IdeaRS.OpenModel.Loading.LoadCase
Load case in the model
This sample shows how to create a load case.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);
//Load case
LoadCase loadCase = new LoadCase();
loadCase.Name = "LC1";
loadCase.LoadType = LoadCaseType.Permanent;
loadCase.Type = LoadCaseSubType.PermanentStandard;
loadCase.Variable = VariableType.NotSet;
loadCase.LoadGroup = new ReferenceElement(loadGroup);
openModel.AddObject(loadCase);

IdeaRS.OpenModel.Loading.LoadCase.#ctor
Constructor

IdeaRS.OpenModel.Loading.LoadCase.Name
Name of load case

IdeaRS.OpenModel.Loading.LoadCase.LoadType
Load case type

IdeaRS.OpenModel.Loading.LoadCase.Type
Sub type

IdeaRS.OpenModel.Loading.LoadCase.Variable
Variable type

IdeaRS.OpenModel.Loading.LoadCase.LoadGroup
Load group

IdeaRS.OpenModel.Loading.LoadCase.Description
Additional info

IdeaRS.OpenModel.Loading.LoadCase.LoadsInPoint
List of point load impulses in this load case

IdeaRS.OpenModel.Loading.LoadCase.LoadsOnLine
List of line load impulses in this load case

IdeaRS.OpenModel.Loading.LoadCase.StrainLoadsOnLine
List of generalized strain load impulses along the line in this load case.

IdeaRS.OpenModel.Loading.LoadCase.PointLoadsOnLine
List of point load impulses in this load case

IdeaRS.OpenModel.Loading.LoadCase.LoadsOnSurface
List surafce load in this load case

IdeaRS.OpenModel.Loading.LoadCase.Settlements
Settlements in this load case

IdeaRS.OpenModel.Loading.LoadCase.TemperatureLoadsOnLine
List of temperature load in this load case